Repository: diemonator/flutter_template
Catalog: lib/app/localization/intl_*.arb
Languages: bg

source: error
bg: Грешка

source: Home
bg: У дома

source: Business
bg: Бизнес

source: School
bg: Училище

source: Settings
bg: Настройки

source: Log in
bg: Влез

source: Enter E-mail
bg: Въведи E-mail

source: Enter password
bg: Въведи парола

source: Main Screen
bg: Главен екран

source: Business view
bg: Бизнес място

source: Home view
bg: Главен екран

source: Settings view
bg: Екран с настройки

source: School view
bg: Училищен екран

source: Home details
bg: Главни детайли

source: Register
bg: Регистрация

# invalidEmail
source: Email is invalid
bg: Майла е невалиден

# invalidPass
source: Password is invalid or too week
bg: Паролата е невалидна или прекалено слаба

# loginFailed
source: Login failed $failure
bg: Неуспешно вписване

# storageError
source: Failed storage read/write procedure
bg: Записването на акаунта е не успешно

# jsonError
source: Failed json mapping
bg: Проблем с полоучените данни

# unknownError
source: Unknown error captured
bg: Не известен проблем

# connectionTimeoutError
source: Connection timeout
bg: Интерне връзката изтече

# weakInternetUpError
source: Too leak internet upload speed
bg: Слаб интернет за изпращане

# weakInternetDownError
source: Too leak internet download speed
bg: Слаб интернет за получаване

# badSecurityError
source: Bad security
bg: Лоша сигурност на връзката

# badResponseError
source: Bad response
bg: Лош отговор на заявка

# canceledRequestError
source: Canceled request
bg: Отказана заявка

# uncaughtUserError
source: Uncaught user exception error
bg: Нехванат потребителска грешка

# badConnectionError
source: Bad Connection
bg: Лоша връзка

source: Unknown network error
bg: Неизвестна мрежова грешка

source: Uncaught network error
bg: Нехваната мрежова грешка

# userLogoutError
source: User log out failed
bg: Грешка при отписване на потребилтел

# userLoginError
source: User login failed
bg: Грешка при вписване на потребилтел

# refreshTokenError
source: Refresh token procedure failed
bg: Грешка при подновяване на аутентикация

# userInitError
source: User initialization failed
bg: Грешка при инициализация на потребил

# userDeletionError
source: User deletion failed
bg: Грешка при изтриване на потребитл

# userSavingError
source: User saving failed
bg: Грешка при записване на потребител
